ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_Комплектующие/ЖБИ_Комплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_Комплектующие</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_Комплектующие/Forms/ФормаЗаписи/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьКомплектыПоНомеклатуре(Комплект, ТаблицаНабораЗаписей, ТаблицаКомплектов)
	
	Для Каждого НомСтр Из ТаблицаКомплектов Цикл
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		Если Комплект = НомСтр.Комплект Тогда 
			НоваяСтр.Номенклатура 	= НомСтр.Комплект;
			НоваяСтр.Комплект 		= Запись.Номенклатура;
			НоваяСтр.Количество 	= НомСтр.Количество;
			НоваяСтр.Автор			= НомСтр.Автор;
			Продолжить;
		КонецЕсли;
		НоваяСтр.Номенклатура 	= Комплект;
		НоваяСтр.Комплект 		= НомСтр.Комплект;
		НоваяСтр.Количество 	= НомСтр.Количество;
		НоваяСтр.Автор			= НомСтр.Автор;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомплектующиеСервер()
	
	//Продублируем запись для комплекта
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_Комплектующие.ПолучитьПустуюТаблицуНаборЗаписей();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура",Запись.Номенклатура);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖБИ_Комплектующие.Комплект КАК Комплект,
	               |	ЖБИ_Комплектующие.Количество КАК Количество,
	               |	ЖБИ_Комплектующие.Автор КАК Автор
	               |ИЗ
	               |	РегистрСведений.ЖБИ_Комплектующие КАК ЖБИ_Комплектующие
	               |ГДЕ
	               |	ЖБИ_Комплектующие.Номенклатура = &Номенклатура";
	
	ТаблицаКомплектов 	= Запрос.Выполнить().Выгрузить();
	РезультатЗапроса 	= Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 		
		СообщениеОбОшибки = "";
		ЗаполнитьКомплектыПоНомеклатуре(РезультатЗапроса.Комплект, ТаблицаНабораЗаписей, ТаблицаКомплектов);		
	КонецЦикла;
	
	Результат = РегистрыСведений.ЖБИ_Комплектующие.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,,СообщениеОбОшибки);
	Если Не Результат Тогда
		Отказ = Истина;	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибки);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запись.Количество 	= 1;
	Запись.Автор 		= Пользователи.ТекущийПользователь();	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаписатьКомплектующиеСервер();
КонецПроцедуры

#КонецОбласти
